-- Вариант 992
-- Запрос 1
SELECT "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ", "Н_ВЕДОМОСТИ"."ДАТА"
FROM "Н_ТИПЫ_ВЕДОМОСТЕЙ"
INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ТВ_ИД" = "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД"
WHERE "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ" = 'Ведомость'
  AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 142390;

-- Запрос 2
SELECT "Н_ЛЮДИ"."ИД", "Н_ОБУЧЕНИЯ"."НЗК", "Н_УЧЕНИКИ"."НАЧАЛО"
FROM "Н_ЛЮДИ"
LEFT OUTER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
LEFT OUTER JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ИД" < 100865
  AND "Н_ОБУЧЕНИЯ"."НЗК" > '933232'
  AND "Н_УЧЕНИКИ"."ГРУППА" < '3100';

-- Доказательство, почему не выводится ни одной строки запрос 2
SELECT "Н_ЛЮДИ"."ИД", "Н_УЧЕНИКИ"."ГРУППА"
FROM "Н_ЛЮДИ"
INNER JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
ORDER BY "Н_ЛЮДИ"."ИД", "Н_УЧЕНИКИ"."ГРУППА";


-- Индексы для запроса 1
CREATE INDEX н_ведомости_тв_ид_индекс ON Н_ВЕДОМОСТИ USING HASH(ТВ_ИД);
CREATE INDEX н_ведомости_члвк_ид_индекс ON Н_ВЕДОМОСТИ(ЧЛВК_ИД);

-- Индексы для запроса 2
CREATE INDEX н_обучения_члвк_ид_индекс ON Н_ОБУЧЕНИЯ USING HASH(ЧЛВК_ИД);
CREATE INDEX н_ученики_члвк_ид_индекс ON Н_УЧЕНИКИ USING HASH(ЧЛВК_ИД);
CREATE INDEX н_обучения_нзк_индекс ON Н_ОБУЧЕНИЯ (НЗК);
CREATE INDEX н_ученики_группа_индекс ON Н_УЧЕНИКИ (ГРУППА);