-- Вариант 522
-- Number 1
SELECT "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ", "Н_ВЕДОМОСТИ"."ИД"
FROM "Н_ТИПЫ_ВЕДОМОСТЕЙ"
RIGHT OUTER JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ТВ_ИД"="Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД"
WHERE "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ" < 'Экзаменационный лист'
    AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 142390;


-- Number 2
SELECT "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ИД", "Н_СЕССИЯ"."УЧГОД"
FROM "Н_ЛЮДИ"
LEFT OUTER JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
LEFT OUTER JOIN "Н_СЕССИЯ" ON "Н_СЕССИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_ЛЮДИ"."ИД" > 152862
  AND "Н_ВЕДОМОСТИ"."ДАТА" > '2022-06-08'
  AND "Н_СЕССИЯ"."УЧГОД" < '2001/2002';


-- Number 3
SELECT COUNT(*) AS Unique_last_names_count
FROM (
    SELECT "Н_ЛЮДИ"."ФАМИЛИЯ"
    FROM "Н_ЛЮДИ"
    GROUP BY "Н_ЛЮДИ"."ФАМИЛИЯ"
     )
AS Unique_last_names;


-- Number 4
-- SELECT COUNT("Н_УЧЕНИКИ"."ГРУППА") AS group_count, "Н_УЧЕНИКИ"."ГРУППА", "Н_ОТДЕЛЫ"."ИМЯ_В_ИМИН_ПАДЕЖЕ"
-- FROM "Н_УЧЕНИКИ"
-- INNER JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
-- INNER JOIN "Н_ОТДЕЛЫ" ON "Н_ОТДЕЛЫ"."ИД" = "Н_ПЛАНЫ"."ОТД_ИД"
-- WHERE "Н_УЧЕНИКИ"."КОНЕЦ" >= '2011-01-01'::timestamp
--   AND "Н_УЧЕНИКИ"."НАЧАЛО" < '2012-01-01'::timestamp
--   AND "Н_ОТДЕЛЫ"."ИМЯ_В_ИМИН_ПАДЕЖЕ" = 'кафедра вычислительной техники'
-- GROUP BY "Н_УЧЕНИКИ"."ГРУППА", "Н_ОТДЕЛЫ"."ИМЯ_В_ИМИН_ПАДЕЖЕ"
-- HAVING COUNT("Н_УЧЕНИКИ"."ГРУППА") = 10
-- ORDER BY "Н_УЧЕНИКИ"."ГРУППА";
-- Number 4
SELECT "Н_УЧЕНИКИ"."ГРУППА"
FROM "Н_УЧЕНИКИ"
INNER JOIN "Н_ПЛАНЫ" ON "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
INNER JOIN "Н_ОТДЕЛЫ" ON "Н_ОТДЕЛЫ"."ИД" = "Н_ПЛАНЫ"."ОТД_ИД"
WHERE "Н_УЧЕНИКИ"."КОНЕЦ" >= '2011-01-01'::timestamp
  AND "Н_УЧЕНИКИ"."НАЧАЛО" < '2012-01-01'::timestamp
  AND (
      "Н_ОТДЕЛЫ"."ИД" = (
    SELECT "Н_ОТДЕЛЫ"."ОТД_ИД"
    FROM "Н_ОТДЕЛЫ"
    WHERE "ИМЯ_В_ИМИН_ПАДЕЖЕ" = 'кафедра вычислительной техники'
    )
      OR "Н_ОТДЕЛЫ"."ИМЯ_В_ИМИН_ПАДЕЖЕ" = 'кафедра вычислительной техники'
    )
GROUP BY "Н_УЧЕНИКИ"."ГРУППА", "Н_ОТДЕЛЫ"."ИМЯ_В_ИМИН_ПАДЕЖЕ"
HAVING COUNT("Н_УЧЕНИКИ"."ГРУППА") = 10
ORDER BY "Н_УЧЕНИКИ"."ГРУППА";


-- Number 5
SELECT "Н_УЧЕНИКИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", ROUND((AVG("Н_ВЕДОМОСТИ"."ОЦЕНКА"::int)::numeric), 2) AS СРЕДНЯЯ_ОЦЕНКА
FROM "Н_УЧЕНИКИ"
INNER JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_УЧЕНИКИ"."ГРУППА" = '4100'
  AND "Н_ВЕДОМОСТИ"."ОЦЕНКА" IN ('5', '4', '3', '2')
GROUP BY "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_УЧЕНИКИ"."ИД"
HAVING ROUND((AVG("Н_ВЕДОМОСТИ"."ОЦЕНКА"::int)::numeric), 2) = (
      SELECT ROUND((AVG("Н_ВЕДОМОСТИ"."ОЦЕНКА"::int)::numeric), 2)
      FROM "Н_УЧЕНИКИ"
      INNER JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
      INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
      WHERE "Н_УЧЕНИКИ"."ГРУППА" = '1100'
        AND "Н_ВЕДОМОСТИ"."ОЦЕНКА" IN ('5', '4', '3', '2')
    )
ORDER BY "Н_УЧЕНИКИ"."ИД";


-- Number 6
SELECT DISTINCT "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_УЧЕНИКИ"."КОНЕЦ"
FROM "Н_УЧЕНИКИ"
INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
INNER JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
INNER JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ПЛАН_ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
INNER JOIN "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ" ON "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НАПС_ИД" = "Н_ПЛАНЫ"."НАПС_ИД"
INNER JOIN "Н_НАПР_СПЕЦ" ON "Н_НАПР_СПЕЦ"."ИД" = "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД"
INNER JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД" = "Н_ПЛАНЫ"."ФО_ИД"
WHERE "Н_УЧЕНИКИ"."ПРИЗНАК" = 'отчисл'
  AND "Н_УЧЕНИКИ"."КОНЕЦ" < '2012-09-01'::timestamp
  AND "Н_НАПР_СПЕЦ"."КОД_НАПРСПЕЦ" = '230101'
  AND "Н_УЧЕНИКИ"."ИД" IN (
      SELECT "Н_УЧЕНИКИ"."ИД"
      FROM "Н_УЧЕНИКИ"
      INNER JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ПЛАН_ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
      INNER JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" ON "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД" = "Н_ПЛАНЫ"."ФО_ИД"
      WHERE "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
    )
ORDER BY "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ";


-- Number 7
SELECT "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", "Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ"::date
FROM "Н_ЛЮДИ"
LEFT OUTER JOIN "Н_УЧЕНИКИ" ON "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
WHERE "Н_УЧЕНИКИ"."ЧЛВК_ИД" IS NULL
ORDER BY "Н_ЛЮДИ"."ИД";
